:PROPERTIES:
:ID:       453cdf41-7eba-4ed6-95ec-66aeb02fc1bb
:header-args: :noweb yes
:END:
#+title: cg/3dtransform
#+filetags: :cg:
#+LATEX_HEADER \usepackage{amsmath}


** Scale Transform
The elem of transform matrix in DuiJiaoXian just scale the value of point in the each axis.
\begin{equation}
P^' = 
\begin{bmatrix}
a & 0 & 0 \\
0 & b & 0 \\
0 & 0 & c
\end{bmatrix}
P
\end{equation}

There is a example:
#+begin_src lua :noweb yes :dir ./ytcg/src
  require("Mat")

  p = Vec.new(1, 2, 3)
  m = Mat.new({
    {3, 0, 0},
    {0, 2, 0},
    {0, 0, 1},
  })
  p = m * p

  print(p:x(),p:y(),p:z())
#+end_src

#+RESULTS:
: 3	4	3

